[
  "Hola, necesito ayuda con un proyecto de análisis de datos.",
  "¿Puedes explicarme qué es el aprendizaje automático?",
  "Tengo un dataset con 10,000 registros de ventas.",
  "¿Cómo puedo identificar patrones en los datos?",
  "Me interesa predecir las ventas del próximo trimestre.",
  "¿Qué algoritmos recomiendas para regresión?",
  "He escuchado sobre redes neuronales, ¿son útiles aquí?",
  "¿Cuál es la diferencia entre clasificación y regresión?",
  "Necesito limpiar los datos antes de entrenar el modelo.",
  "¿Cómo manejo los valores faltantes en el dataset?",
  "Algunos registros tienen fechas en formato incorrecto.",
  "¿Debo normalizar las variables numéricas?",
  "¿Qué es la validación cruzada?",
  "¿Cómo divido el dataset en entrenamiento y prueba?",
  "¿Qué proporción recomiendas: 80-20 o 70-30?",
  "He entrenado un modelo de regresión lineal.",
  "El R² que obtuve es 0.65, ¿es bueno?",
  "¿Cómo puedo mejorar el rendimiento del modelo?",
  "¿Debería probar con más features o menos?",
  "¿Qué es el overfitting y cómo lo evito?",
  "He notado que el modelo funciona bien en entrenamiento pero mal en prueba.",
  "¿Debería usar regularización?",
  "¿Cuál es la diferencia entre L1 y L2?",
  "¿Qué es un hiperparámetro?",
  "¿Cómo optimizo los hiperparámetros del modelo?",
  "He probado con GridSearchCV pero tarda mucho.",
  "¿Existe una alternativa más rápida?",
  "¿Qué es RandomSearchCV?",
  "¿Cómo interpreto la matriz de confusión?",
  "Mi modelo tiene alta precisión pero bajo recall.",
  "¿Qué significa eso en términos prácticos?",
  "¿Cómo ajusto el umbral de decisión?",
  "¿Qué es la curva ROC?",
  "¿Cómo calculo el AUC?",
  "¿Qué valor de AUC se considera bueno?",
  "He implementado un modelo de árbol de decisión.",
  "¿Cómo evito que el árbol crezca demasiado?",
  "¿Qué es el pruning?",
  "¿Debería usar Random Forest en lugar de un solo árbol?",
  "¿Cuántos árboles recomiendas en el ensemble?",
  "¿Qué es el boosting?",
  "¿Cuál es la diferencia entre bagging y boosting?",
  "He escuchado sobre XGBoost, ¿es mejor que Random Forest?",
  "¿Cómo manejo el desbalance de clases en el dataset?",
  "¿Debería usar SMOTE o ajustar los pesos de las clases?",
  "¿Qué es el feature engineering?",
  "¿Cómo creo nuevas features a partir de las existentes?",
  "¿Debería incluir interacciones entre variables?",
  "¿Cómo selecciono las features más importantes?",
  "Gracias por toda la ayuda, ha sido muy útil."
]
